___

<a href='http://www.pieriandata.com'> <img src='../Pierian_Data_Logo.png' /></a>
___

# DataFrames

DataFrames are the workhorse of pandas and are directly inspired by the R programming language. We can think of a DataFrame as a bunch of Series objects put together to share the same index. Let's use pandas to explore this topic!

In [1]:
import pandas as pd
import numpy as np

In [2]:
from numpy.random import randn
np.random.seed(101)

In [11]:
df = pd.DataFrame(randn(5,4),index='A B C D E'.split(),columns='W X Y Z'.split())

In [12]:
df

          W         X         Y         Z
A -1.115710 -1.385379 -1.329660  0.041460
B -0.411055 -0.771329  0.110477 -0.804652
C  0.253548  0.649148  0.358941 -1.080471
D  0.902398  0.161781  0.833029  0.975720
E -0.388239  0.783316 -0.708954  0.586847

## Selection and Indexing

Let's learn the various methods to grab data from a DataFrame

In [13]:
df['W']

A   -1.115710
B   -0.411055
C    0.253548
D    0.902398
E   -0.388239
Name: W, dtype: float64

In [17]:
# Pass a list of column names
df[['W','Z']]

          W         Z
A -1.115710  0.041460
B -0.411055 -0.804652
C  0.253548 -1.080471
D  0.902398  0.975720
E -0.388239  0.586847

In [189]:
# SQL Syntax (NOT RECOMMENDED!)
df.W

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

DataFrame Columns are just Series

In [190]:
type(df['W'])

pandas.core.series.Series

**Creating a new column:**

In [18]:
df['new'] = df['W'] + df['Y']

In [19]:
df

          W         X         Y         Z       new
A -1.115710 -1.385379 -1.329660  0.041460 -2.445370
B -0.411055 -0.771329  0.110477 -0.804652 -0.300578
C  0.253548  0.649148  0.358941 -1.080471  0.612489
D  0.902398  0.161781  0.833029  0.975720  1.735427
E -0.388239  0.783316 -0.708954  0.586847 -1.097192

** Removing Columns**

In [24]:
df.drop('new',axis=1)

          W         X         Y         Z
A -1.115710 -1.385379 -1.329660  0.041460
B -0.411055 -0.771329  0.110477 -0.804652
C  0.253548  0.649148  0.358941 -1.080471
D  0.902398  0.161781  0.833029  0.975720
E -0.388239  0.783316 -0.708954  0.586847

In [26]:
# Not inplace unless specified!
df

          W         X         Y         Z       new
A -1.115710 -1.385379 -1.329660  0.041460 -2.445370
B -0.411055 -0.771329  0.110477 -0.804652 -0.300578
C  0.253548  0.649148  0.358941 -1.080471  0.612489
D  0.902398  0.161781  0.833029  0.975720  1.735427
E -0.388239  0.783316 -0.708954  0.586847 -1.097192

In [27]:
df.drop('new',axis=1,inplace=True)

In [28]:
df

          W         X         Y         Z
A -1.115710 -1.385379 -1.329660  0.041460
B -0.411055 -0.771329  0.110477 -0.804652
C  0.253548  0.649148  0.358941 -1.080471
D  0.902398  0.161781  0.833029  0.975720
E -0.388239  0.783316 -0.708954  0.586847

Can also drop rows this way:

In [29]:
df.drop('E',axis=0)

          W         X         Y         Z
A -1.115710 -1.385379 -1.329660  0.041460
B -0.411055 -0.771329  0.110477 -0.804652
C  0.253548  0.649148  0.358941 -1.080471
D  0.902398  0.161781  0.833029  0.975720

In [32]:
df.shape

(5, 4)

** Selecting Rows**

In [33]:
df.loc['A']

W   -1.115710
X   -1.385379
Y   -1.329660
Z    0.041460
Name: A, dtype: float64

Or select based off of position instead of label

In [39]:
df.loc['B'] == df.iloc[1]

W    True
X    True
Y    True
Z    True
Name: B, dtype: bool

** Selecting subset of rows and columns **

In [40]:
df.loc['B','Y']

0.11047741113032297

In [44]:
df.loc[['A','B'],['W','Y']]

          W         Y
A -1.115710 -1.329660
B -0.411055  0.110477

In [45]:
df

          W         X         Y         Z
A -1.115710 -1.385379 -1.329660  0.041460
B -0.411055 -0.771329  0.110477 -0.804652
C  0.253548  0.649148  0.358941 -1.080471
D  0.902398  0.161781  0.833029  0.975720
E -0.388239  0.783316 -0.708954  0.586847

### Conditional Selection

An important feature of pandas is conditional selection using bracket notation, very similar to numpy:

In [92]:
df>0

        index      W      X      Y      Z
States
CA       True  False  False  False   True
NY       True  False  False   True  False
WY       True   True   True   True  False
OR       True   True   True   True   True
CO       True  False   True  False   True

In [93]:
df[df>0]

       index         W         X         Y         Z
States
CA         A       NaN       NaN       NaN  0.041460
NY         B       NaN       NaN  0.110477       NaN
WY         C  0.253548  0.649148  0.358941       NaN
OR         D  0.902398  0.161781  0.833029  0.975720
CO         E       NaN  0.783316       NaN  0.586847

In [95]:
df['W']>0

States
CA    False
NY    False
WY     True
OR     True
CO    False
Name: W, dtype: bool

In [103]:
s = pd.Series([False, False, True, True, False], index='CA NY WY OR CO'.split())

In [110]:
(df['W']>0) == s

States
CA    True
NY    True
WY    True
OR    True
CO    True
dtype: bool

In [111]:
df[df['W']>0]

       index         W         X         Y         Z
States
WY         C  0.253548  0.649148  0.358941 -1.080471
OR         D  0.902398  0.161781  0.833029  0.975720

In [104]:
df[s]

       index         W         X         Y         Z
States
WY         C  0.253548  0.649148  0.358941 -1.080471
OR         D  0.902398  0.161781  0.833029  0.975720

In [115]:
df[df['W']>0]['Y']

States
WY    0.358941
OR    0.833029
Name: Y, dtype: float64

In [118]:
df[df['W']>0][['Y','X']]

               Y         X
States
WY      0.358941  0.649148
OR      0.833029  0.161781

For two conditions you can use | and & with parenthesis:

In [65]:
df[(df['W']>0) & (df['Y'] > 0.5)]

          W         X         Y        Z
D  0.902398  0.161781  0.833029  0.97572

## More Index Details

Let's discuss some more features of indexing, including resetting the index or setting it something else. We'll also talk about index hierarchy!

In [121]:
df

       index         W         X         Y         Z
States
CA         A -1.115710 -1.385379 -1.329660  0.041460
NY         B -0.411055 -0.771329  0.110477 -0.804652
WY         C  0.253548  0.649148  0.358941 -1.080471
OR         D  0.902398  0.161781  0.833029  0.975720
CO         E -0.388239  0.783316 -0.708954  0.586847

In [122]:
# Reset to default 0,1...n index
df.reset_index(inplace=True)
df

  States index         W         X         Y         Z
0     CA     A -1.115710 -1.385379 -1.329660  0.041460
1     NY     B -0.411055 -0.771329  0.110477 -0.804652
2     WY     C  0.253548  0.649148  0.358941 -1.080471
3     OR     D  0.902398  0.161781  0.833029  0.975720
4     CO     E -0.388239  0.783316 -0.708954  0.586847

In [123]:
df.drop("index", axis=1, inplace=True)

In [124]:
df

  States         W         X         Y         Z
0     CA -1.115710 -1.385379 -1.329660  0.041460
1     NY -0.411055 -0.771329  0.110477 -0.804652
2     WY  0.253548  0.649148  0.358941 -1.080471
3     OR  0.902398  0.161781  0.833029  0.975720
4     CO -0.388239  0.783316 -0.708954  0.586847

In [125]:
newind = 'CA NY WY OR CO'.split()

In [126]:
newind

['CA', 'NY', 'WY', 'OR', 'CO']

In [127]:
df['States'] = newind

In [128]:
df

  States         W         X         Y         Z
0     CA -1.115710 -1.385379 -1.329660  0.041460
1     NY -0.411055 -0.771329  0.110477 -0.804652
2     WY  0.253548  0.649148  0.358941 -1.080471
3     OR  0.902398  0.161781  0.833029  0.975720
4     CO -0.388239  0.783316 -0.708954  0.586847

In [132]:
df.set_index('States')

               W         X         Y         Z
States
CA     -1.115710 -1.385379 -1.329660  0.041460
NY     -0.411055 -0.771329  0.110477 -0.804652
WY      0.253548  0.649148  0.358941 -1.080471
OR      0.902398  0.161781  0.833029  0.975720
CO     -0.388239  0.783316 -0.708954  0.586847

In [133]:
df

  States         W         X         Y         Z
0     CA -1.115710 -1.385379 -1.329660  0.041460
1     NY -0.411055 -0.771329  0.110477 -0.804652
2     WY  0.253548  0.649148  0.358941 -1.080471
3     OR  0.902398  0.161781  0.833029  0.975720
4     CO -0.388239  0.783316 -0.708954  0.586847

In [134]:
df.set_index('States',inplace=True)

In [135]:
df

               W         X         Y         Z
States
CA     -1.115710 -1.385379 -1.329660  0.041460
NY     -0.411055 -0.771329  0.110477 -0.804652
WY      0.253548  0.649148  0.358941 -1.080471
OR      0.902398  0.161781  0.833029  0.975720
CO     -0.388239  0.783316 -0.708954  0.586847

In [216]:
df.set_index('States',inplace=True)

In [218]:
df

               W         X         Y         Z
States
CA      2.706850  0.628133  0.907969  0.503826
NY      0.651118 -0.319318 -0.848077  0.605965
WY     -2.018168  0.740122  0.528813 -0.589001
OR      0.188695 -0.758872 -0.933237  0.955057
CO      0.190794  1.978757  2.605967  0.683509

## Multi-Index and Index Hierarchy

Let us go over how to work with Multi-Index, first we'll create a quick example of what a Multi-Indexed DataFrame would look like:

In [136]:
# Index Levels
outside = ['G1','G1','G1','G2','G2','G2']
inside = [1,2,3,1,2,3]
hier_index = list(zip(outside,inside))
hier_index = pd.MultiIndex.from_tuples(hier_index)

In [137]:
hier_index

MultiIndex(levels=[['G1', 'G2'], [1, 2, 3]],
           labels=[[0, 0, 0, 1, 1, 1], [0, 1, 2, 0, 1, 2]])

In [138]:
df = pd.DataFrame(np.random.randn(6,2),index=hier_index,columns=['A','B'])
df

             A         B
G1 1 -1.621348  0.677535
   2  0.026105 -1.678284
   3  0.333973 -0.532471
G2 1  2.117727  0.197524
   2  2.302987  0.729024
   3 -0.863091  0.305632

Now let's show how to index this! For index hierarchy we use df.loc[], if this was on the columns axis, you would just use normal bracket notation df[]. Calling one level of the index returns the sub-dataframe:

In [139]:
df.loc['G1']

          A         B
1 -1.621348  0.677535
2  0.026105 -1.678284
3  0.333973 -0.532471

In [140]:
df.loc['G1'].loc[1]

A   -1.621348
B    0.677535
Name: 1, dtype: float64

In [141]:
df.index.names

FrozenList([None, None])

In [142]:
df.index.names = ['Group','Num']

In [143]:
df

                  A         B
Group Num
G1    1   -1.621348  0.677535
      2    0.026105 -1.678284
      3    0.333973 -0.532471
G2    1    2.117727  0.197524
      2    2.302987  0.729024
      3   -0.863091  0.305632

In [158]:
df.loc['G2', 2].loc['B']

0.7290237321354455

In [164]:
df.loc['G1']

            A         B
Num
1   -1.621348  0.677535
2    0.026105 -1.678284
3    0.333973 -0.532471

In [174]:
df.xs(1, level="Num")

              A         B
Group
G1    -1.621348  0.677535
G2     2.117727  0.197524

In [166]:
df.xs('G1')

            A         B
Num
1   -1.621348  0.677535
2    0.026105 -1.678284
3    0.333973 -0.532471

In [175]:
df.xs(['G1',1])

A   -1.621348
B    0.677535
Name: (G1, 1), dtype: float64

In [273]:
df.xs(1,level='Num')

              A         B
Group
G1     0.153661  0.167638
G2    -1.549671  0.435253

# Great Job!